resources/test-fixtures/wssecurity/soap-with-existing-wsu-id.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  Body'de zaten wsu:Id set olan SOAP envelope.

  WsSecuritySignatureService kontratı (kod: signSoapEnvelope):
    bodyElement.setAttribute("Id", BODY_ID);
    bodyElement.removeAttribute("wsu:Id");

  Yani signer mevcut wsu:Id'yi SİLER ve kendi
  Id="SignedSoapBodyContent" attribute'unu set eder. Test bu davranışı
  hem positively (yeni Id varlığı) hem negatively (eski wsu:Id yokluğu)
  doğrular.

  Bu davranış güvenlik açısından kritik: client'ın gönderdiği wsu:Id'ye
  signer güvenirse, çakışma / shadow-reference saldırılarına alan kalır.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                  xmlns:test="http://test.example.com">
   <soapenv:Header/>
   <soapenv:Body wsu:Id="ClientProvidedBodyId-do-not-trust">
      <test:TestRequest>
         <test:RequestId>WSU-ID-OVERRIDE-TEST</test:RequestId>
         <test:Data>
            <test:Message>Body wsu:Id signer tarafından override edilmeli</test:Message>
         </test:Data>
      </test:TestRequest>
   </soapenv:Body>
</soapenv:Envelope>
